In [ ]:
import pandas as pd
import numpy as np
from datetime import datetime
from pandas import Series
import warnings
warnings.filterwarnings("ignore")

In [ ]:
df=pd.read_csv("StudentsPerformance.csv")
df.head(10)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92
7,male,group B,some college,free/reduced,none,40,43,39
8,male,group D,high school,free/reduced,completed,64,64,67
9,female,group B,high school,free/reduced,none,38,60,50

In [ ]:
df.shape

(1000, 15)

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
gender                         1000 non-null object
race/ethnicity                 1000 non-null object
parental level of education    1000 non-null object
lunch                          1000 non-null object
test preparation course        1000 non-null object
math score                     1000 non-null int64
reading score                  1000 non-null int64
writing score                  1000 non-null int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

In [ ]:
df.columns

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score', 'Math_PassStatus', 'Reading_PassStatus',
       'Writing_PassStatus', 'Total_Marks', 'Percentage', 'OverAll_PassStatus',
       'Grade'],
      dtype='object')

In [ ]:
df['gender'].value_counts()

female    518
male      482
Name: gender, dtype: int64

In [ ]:
df['test preparation course'].value_counts()

none         642
completed    358
Name: test preparation course, dtype: int64

In [ ]:
a=df['race/ethnicity'].value_counts()
a

group C    319
group D    262
group B    190
group E    140
group A     89
Name: race/ethnicity, dtype: int64

In [ ]:
df.describe()

       math score  reading score  writing score  Total_Marks   Percentage
count  1000.00000    1000.000000    1000.000000  1000.000000  1000.000000
mean     66.08900      69.169000      68.054000   203.312000    67.770667
std      15.16308      14.600192      15.195657    42.771978    14.257326
min       0.00000      17.000000      10.000000    27.000000     9.000000
25%      57.00000      59.000000      57.750000   175.000000    58.333333
50%      66.00000      70.000000      69.000000   205.000000    68.333333
75%      77.00000      79.000000      79.000000   233.000000    77.666667
max     100.00000     100.000000     100.000000   300.000000   100.000000

In [ ]:
df.describe(include=['O'])

,gender,race/ethnicity,parental level of education,lunch,test preparation course
count,1000,1000,1000,1000,1000
unique,2,5,6,2,2
top,female,group C,some college,standard,none
freq,518,319,226,645,642